import time
import langsmith_settings  # включаем трейсинг для langsmith
from rag_agent import agent, retriever # импортируем нашу готовую rag-цепочку

# список из 10 вопросов для проверки
questions = [
    "На каких платформах работает Jois?",
    "Можно ли пользоваться Jois бесплатно и какие есть ограничения?",
    "Сколько времени мои данные хранятся на серверах после того, как я удалила аккаунт?",
    "Как Jois понимает, какую эмоцию нужно показать на лице во время разговора?",
    "Какие преимущества получает пользователь с Premium-подпиской при кастомизации своего 3D-аватара?",
    "Где обрабатываются мои голосовые сообщения и безопасно ли это?",
    "Я еду в поезде, где совсем нет связи. Смогу ли я поговорить с Джойс?",
    "Где я могу переодеть своего аватара?",
    "Можно ли синхронизировать Джойс с умным домом, чтобы она включала свет?",
    "Как мне заказать доставку одежды из Pinduoduo через приложение Jois?"
]

print("Запуск RAG-теста\n")

# по очереди проходим по всем вопросам в цикле
for i, q in enumerate(questions, 1):
    print(f"Вопрос {i}: {q}")
    # извлекаем топ-3 фрагмента из базы знаний
    found_docs = retriever.invoke(q)

    print("--- Найденные чанки (Контекст): ---")
    for i, doc in enumerate(found_docs, 1):
        # печатаем первые 100 символов для проверки релевантности
        print(f"Чанк {i}: {doc.page_content[:100]}...") 
    print("-" * 30)
    # засекаем время старта
    start = time.time()

    try:
        # отправляем вопрос в нашу цепочку
        response = agent.invoke(q)
        
        # выводим в консоль чистый текстовый ответ, который сгенерировала джойс
        print(f"Ответ Jois:\n{response}")

    # если что-то сломалось, ловим ошибку, чтобы тест не упал на середине
    except Exception as e:
        print(f"Ошибка при обработке вопроса: {e}")
        
    # считаем и выводим время работы
    print(f"Время выполнения: {time.time() - start:.2f} сек.")
    print("-" * 50)